{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The idea of this notebook is to:\n",
    "\n",
    "Get a SPARQL query for all items that are instances of scientific articles: \n",
    "\n",
    "P31 | Q13442814\n",
    "\n",
    "\n",
    "AND \n",
    "\n",
    "contain \"Human visual cortex\" in the label Len. \n",
    "\n",
    "\n",
    "The SPARQL query is:\n",
    "\n",
    "SELECT ?item ?itemLabel\n",
    "WHERE { \n",
    "  ?item wdt:P31 wd:Q13442814.\n",
    "  ?item rdfs:label ?itemLabel. \n",
    "  FILTER(CONTAINS(LCASE(?itemLabel), \"human visual cortex\"@en)). \n",
    "} limit 1000\n",
    "\n",
    "We will actually limit the query to Journal of Neuroscience at first\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# pip install sparqlwrapper\n",
    "# https://rdflib.github.io/sparqlwrapper/\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "endpoint_url = \"https://query.wikidata.org/sparql\"\n",
    "\n",
    "query = \"\"\"SELECT ?item ?itemLabel WHERE {\n",
    "  ?item wdt:P31 wd:Q13442814;\n",
    "    wdt:P407 wd:Q1860;\n",
    "    wdt:P1433 wd:Q1709864;\n",
    "    rdfs:label ?itemLabel.\n",
    "  FILTER(CONTAINS(LCASE(?itemLabel), \"human visual cortex\"@en))\n",
    "  OPTIONAL {  }\n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "def get_results(endpoint_url, query):\n",
    "    sparql = SPARQLWrapper(endpoint_url)\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    return sparql.query().convert()\n",
    "\n",
    "\n",
    "results = get_results(endpoint_url, query)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q48630076|P921|Q68019463\n",
      "Q34077490|P921|Q68019463\n",
      "Q59916034|P921|Q68019463\n",
      "Q45932530|P921|Q68019463\n",
      "Q48410589|P921|Q68019463\n",
      "Q34991327|P921|Q68019463\n",
      "Q30488847|P921|Q68019463\n",
      "Q37162730|P921|Q68019463\n",
      "Q40082444|P921|Q68019463\n",
      "Q30100953|P921|Q68019463\n",
      "Q48127744|P921|Q68019463\n",
      "Q38841184|P921|Q68019463\n",
      "Q36928476|P921|Q68019463\n",
      "Q48279697|P921|Q68019463\n",
      "Q37308180|P921|Q68019463\n",
      "Q36534304|P921|Q68019463\n",
      "Q34511065|P921|Q68019463\n",
      "Q48625841|P921|Q68019463\n",
      "Q47203846|P921|Q68019463\n",
      "Q37038007|P921|Q68019463\n",
      "Q38813524|P921|Q68019463\n",
      "Q30529917|P921|Q68019463\n",
      "Q43724976|P921|Q68019463\n",
      "Q33562794|P921|Q68019463\n",
      "Q48301298|P921|Q68019463\n",
      "Q33792624|P921|Q68019463\n",
      "Q39172088|P921|Q68019463\n",
      "Q48291238|P921|Q68019463\n",
      "Q46213294|P921|Q68019463\n",
      "Q34162831|P921|Q68019463\n",
      "Q48732690|P921|Q68019463\n",
      "Q47570970|P921|Q68019463\n",
      "Q47310330|P921|Q68019463\n",
      "Q30446884|P921|Q68019463\n",
      "Q35914122|P921|Q68019463\n",
      "Q48144294|P921|Q68019463\n",
      "Q47923428|P921|Q68019463\n",
      "Q52602821|P921|Q68019463\n",
      "Q35748924|P921|Q68019463\n",
      "Q44595366|P921|Q68019463\n",
      "Q37505006|P921|Q68019463\n",
      "Q34392270|P921|Q68019463\n",
      "Q37381867|P921|Q68019463\n",
      "Q45294058|P921|Q68019463\n",
      "Q35098862|P921|Q68019463\n",
      "Q34159826|P921|Q68019463\n",
      "Q47353890|P921|Q68019463\n",
      "Q45961175|P921|Q68019463\n",
      "Q36973119|P921|Q68019463\n",
      "Q34769492|P921|Q68019463\n",
      "Q47939468|P921|Q68019463\n",
      "Q46470711|P921|Q68019463\n",
      "Q57038664|P921|Q68019463\n"
     ]
    }
   ],
   "source": [
    "b  = list()\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    a = result['item']['value']\n",
    "    b.append(a.split('/')[4])\n",
    "\n",
    "    \n",
    "for q in set(b):\n",
    "    print( q + \"|P921|Q68019463\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Oh, nice. So now, we will get not only for journal of neuroscience, but for all journals which the main topic is neuroscience."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# pip install sparqlwrapper\n",
    "# https://rdflib.github.io/sparqlwrapper/\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "endpoint_url = \"https://query.wikidata.org/sparql\"\n",
    "\n",
    "query = \"\"\"SELECT ?item ?itemLabel WHERE {\n",
    "  ?item wdt:P31 wd:Q13442814;\n",
    "    wdt:P407 wd:Q1860;\n",
    "    wdt:P1433/wdt:P921 wd:Q207011;\n",
    "    rdfs:label ?itemLabel.\n",
    "  FILTER(CONTAINS(LCASE(?itemLabel), \"human visual cortex\"@en))\n",
    "  OPTIONAL {  }\n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "def get_results(endpoint_url, query):\n",
    "    sparql = SPARQLWrapper(endpoint_url)\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    return sparql.query().convert()\n",
    "\n",
    "\n",
    "results = get_results(endpoint_url, query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q48630076|P921|Q68019463\n",
      "Q34077490|P921|Q68019463\n",
      "Q59916034|P921|Q68019463\n",
      "Q45932530|P921|Q68019463\n",
      "Q48410589|P921|Q68019463\n",
      "Q34991327|P921|Q68019463\n",
      "Q28143139|P921|Q68019463\n",
      "Q30488847|P921|Q68019463\n",
      "Q37162730|P921|Q68019463\n",
      "Q40082444|P921|Q68019463\n",
      "Q34065275|P921|Q68019463\n",
      "Q30100953|P921|Q68019463\n",
      "Q48223508|P921|Q68019463\n",
      "Q41680140|P921|Q68019463\n",
      "Q48127744|P921|Q68019463\n",
      "Q38841184|P921|Q68019463\n",
      "Q36928476|P921|Q68019463\n",
      "Q48279697|P921|Q68019463\n",
      "Q37308180|P921|Q68019463\n",
      "Q36534304|P921|Q68019463\n",
      "Q37302131|P921|Q68019463\n",
      "Q34511065|P921|Q68019463\n",
      "Q48625841|P921|Q68019463\n",
      "Q48906239|P921|Q68019463\n",
      "Q47203846|P921|Q68019463\n",
      "Q50650342|P921|Q68019463\n",
      "Q37038007|P921|Q68019463\n",
      "Q38813524|P921|Q68019463\n",
      "Q30529917|P921|Q68019463\n",
      "Q43724976|P921|Q68019463\n",
      "Q35690530|P921|Q68019463\n",
      "Q33778001|P921|Q68019463\n",
      "Q33562794|P921|Q68019463\n",
      "Q48301298|P921|Q68019463\n",
      "Q48527128|P921|Q68019463\n",
      "Q33792624|P921|Q68019463\n",
      "Q46377082|P921|Q68019463\n",
      "Q39172088|P921|Q68019463\n",
      "Q46213294|P921|Q68019463\n",
      "Q34162831|P921|Q68019463\n",
      "Q48291238|P921|Q68019463\n",
      "Q48732690|P921|Q68019463\n",
      "Q47570970|P921|Q68019463\n",
      "Q47310330|P921|Q68019463\n",
      "Q30446884|P921|Q68019463\n",
      "Q35914122|P921|Q68019463\n",
      "Q48144294|P921|Q68019463\n",
      "Q47923428|P921|Q68019463\n",
      "Q52602821|P921|Q68019463\n",
      "Q35748924|P921|Q68019463\n",
      "Q44595366|P921|Q68019463\n",
      "Q36062542|P921|Q68019463\n",
      "Q30492204|P921|Q68019463\n",
      "Q37505006|P921|Q68019463\n",
      "Q34392270|P921|Q68019463\n",
      "Q37381867|P921|Q68019463\n",
      "Q45294058|P921|Q68019463\n",
      "Q35098862|P921|Q68019463\n",
      "Q34159826|P921|Q68019463\n",
      "Q47353890|P921|Q68019463\n",
      "Q45961175|P921|Q68019463\n",
      "Q44811408|P921|Q68019463\n",
      "Q34769492|P921|Q68019463\n",
      "Q36973119|P921|Q68019463\n",
      "Q46470711|P921|Q68019463\n",
      "Q47939468|P921|Q68019463\n",
      "Q57038664|P921|Q68019463\n",
      "Q28268518|P921|Q68019463\n"
     ]
    }
   ],
   "source": [
    "b  = list()\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    a = result['item']['value']\n",
    "    b.append(a.split('/')[4])\n",
    "\n",
    "    \n",
    "for q in set(b):\n",
    "    print( q + \"|P921|Q68019463\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
